In [1]:
#Pandas For Data Analysis 
#Import Pandas
import pandas as pd

In [2]:
#Find working directory
import os
os.getcwd()

'/Users/robertwrobel/Code'

In [3]:
#Read and Excel file and a CSV file into two separate data frames
df1 = pd.read_csv('data.csv')
df2 = pd.read_excel('data.xlsx')

In [4]:
#View the first 5 rows of df1, the first 10 rows of df1, and the last 10 rows of df2
print(df1.head()) #5 is the default
print(df1.head(10))
print(df2.tail(10))

               Name  Age Category  Value  Count
0      Nicole Allen   25        C   54.0    5.0
1  Anthony Martinez   54        A   49.0    8.0
2     Shawn Gilbert   39        B   64.0    3.0
3        Eric Ellis   35        A   35.0    4.0
4    Chelsea Flores   24        C    6.0    3.0
               Name  Age Category  Value  Count
0      Nicole Allen   25        C   54.0    5.0
1  Anthony Martinez   54        A   49.0    8.0
2     Shawn Gilbert   39        B   64.0    3.0
3        Eric Ellis   35        A   35.0    4.0
4    Chelsea Flores   24        C    6.0    3.0
5      Karen Carson   51        C   71.0    2.0
6     Rhonda Wilcox   51        A   53.0   10.0
7      Barbara Tran   24        A   62.0    9.0
8      Matthew Ward   31        B   40.0    8.0
9       Joshua Ware   19        A   81.0    4.0
                    Name  Age Category  Value  Count
90          Donald Ayala   56        B   33.0    2.0
91          John Ramirez   39        A   69.0    5.0
92     Dr. Jonathan Cook   27        B   83.0    9.0
93        Michael Miller   37        A   19.0    2.0
94        Karen Williams   47        B   29.0    8.0
95          Jamie Knight   52        B   34.0   10.0
96          Linda Dalton   61        A   61.0    3.0
97        Donald Blevins   60        C   58.0    4.0
98  Mrs. Mary Sampson MD   42        C   81.0    5.0
99    Lawrence Rodriguez   59        B   23.0    9.0

In [5]:
#Summary statistics
df1.describe()

              Age       Value      Count
count  100.000000   98.000000  99.000000
mean    40.260000   45.530612   5.232323
std     14.059484   28.023629   2.791490
min     18.000000    1.000000   1.000000
25%     27.750000   21.250000   3.000000
50%     41.000000   43.500000   5.000000
75%     52.250000   64.750000   7.500000
max     64.000000  100.000000  10.000000

In [6]:
#Count missing values and drop rows with missing values
print(df1.isnull().sum())

df1.dropna(inplace=True) # "inplace=True" modifies the existing data frame
print(df1.isnull().sum())

Name        0
Age         0
Category    1
Value       2
Count       1
dtype: int64
Name        0
Age         0
Category    0
Value       0
Count       0
dtype: int64

In [7]:
df1.describe()

             Age       Value      Count
count  97.000000   97.000000  97.000000
mean   40.175258   45.958763   5.288660
std    14.000752   27.845151   2.791202
min    18.000000    1.000000   1.000000
25%    28.000000   22.000000   3.000000
50%    41.000000   44.000000   5.000000
75%    52.000000   65.000000   8.000000
max    64.000000  100.000000  10.000000

In [8]:
#Check for duplicate rows
duplicate_count = df1.duplicated().sum()
print(duplicate_count)

#duplicates = df1.duplicated()
#print(duplicates)

#View instances of the duplicated rows
duplicated_rows = df1[df1.duplicated()]
duplicated_rows

2

               Name  Age Category  Value  Count
17  Alexandra Green   21        C    7.0    9.0
24      Mark Hester   35        C   44.0    4.0

In [9]:
#Checking for duplicates using a subset of columns instead of looking for exact duplicates
duplicates = df1.duplicated(subset=['Name', 'Age'])

In [10]:
#Drop duplicate rows
df1.drop_duplicates(inplace=True)

In [11]:
df1.columns

Index(['Name', 'Age', 'Category', 'Value', 'Count'], dtype='object')

In [12]:
#Split "Text to columns"
df1[['First Name', 'Last Name']] = df1['Name'].str.split(n=1, expand=True)
df1.columns
df1.head()

               Name  Age Category  Value  Count First Name Last Name
0      Nicole Allen   25        C   54.0    5.0     Nicole     Allen
1  Anthony Martinez   54        A   49.0    8.0    Anthony  Martinez
2     Shawn Gilbert   39        B   64.0    3.0      Shawn   Gilbert
3        Eric Ellis   35        A   35.0    4.0       Eric     Ellis
4    Chelsea Flores   24        C    6.0    3.0    Chelsea    Flores

In [13]:
#Renaming columns with a dictionary
df1.rename(columns={'Name': 'Full Name'}, inplace=True)
df1.head()

          Full Name  Age Category  Value  Count First Name Last Name
0      Nicole Allen   25        C   54.0    5.0     Nicole     Allen
1  Anthony Martinez   54        A   49.0    8.0    Anthony  Martinez
2     Shawn Gilbert   39        B   64.0    3.0      Shawn   Gilbert
3        Eric Ellis   35        A   35.0    4.0       Eric     Ellis
4    Chelsea Flores   24        C    6.0    3.0    Chelsea    Flores

In [14]:
#Filter rows based on condition
over30 = df1[df1['Age'] > 30]
over30.head()

          Full Name  Age Category  Value  Count First Name Last Name
1  Anthony Martinez   54        A   49.0    8.0    Anthony  Martinez
2     Shawn Gilbert   39        B   64.0    3.0      Shawn   Gilbert
3        Eric Ellis   35        A   35.0    4.0       Eric     Ellis
5      Karen Carson   51        C   71.0    2.0      Karen    Carson
6     Rhonda Wilcox   51        A   53.0   10.0     Rhonda    Wilcox

In [15]:
#Sorting by a column
age_desc = df1.sort_values('Age', ascending=False)
print(age_desc)

            Full Name  Age Category  Value  Count First Name   Last Name
56  Angela Oneill DDS   64        C   55.0    3.0     Angela  Oneill DDS
47      Melissa Lewis   63        B   72.0    2.0    Melissa       Lewis
14          Lisa Chen   61        B   41.0   10.0       Lisa        Chen
31      Joshua Hughes   61        B   41.0    1.0     Joshua      Hughes
34       Sandra Jones   61        C   32.0    6.0     Sandra       Jones
..                ...  ...      ...    ...    ...        ...         ...
9         Joshua Ware   19        A   81.0    4.0     Joshua        Ware
83        Megan Brown   19        C   95.0    1.0      Megan       Brown
81       Peter Hansen   19        C   55.0    4.0      Peter      Hansen
40   Brenda Valentine   19        A   31.0    7.0     Brenda   Valentine
53       Stanley Dean   18        A   30.0   10.0    Stanley        Dean

[95 rows x 7 columns]

In [16]:
age_asc = df1.sort_values('Age', ascending=True)
print(age_asc)

            Full Name  Age Category  Value  Count First Name   Last Name
53       Stanley Dean   18        A   30.0   10.0    Stanley        Dean
40   Brenda Valentine   19        A   31.0    7.0     Brenda   Valentine
50      James Tran MD   19        B   15.0    1.0      James     Tran MD
9         Joshua Ware   19        A   81.0    4.0     Joshua        Ware
81       Peter Hansen   19        C   55.0    4.0      Peter      Hansen
..                ...  ...      ...    ...    ...        ...         ...
14          Lisa Chen   61        B   41.0   10.0       Lisa        Chen
96       Linda Dalton   61        A   61.0    3.0      Linda      Dalton
34       Sandra Jones   61        C   32.0    6.0     Sandra       Jones
47      Melissa Lewis   63        B   72.0    2.0    Melissa       Lewis
56  Angela Oneill DDS   64        C   55.0    3.0     Angela  Oneill DDS

[95 rows x 7 columns]

In [17]:
#Merging data frames
dfL = pd.DataFrame({'ID': [1, 2, 3, 4], 'Value': ['A', 'B', 'C','D']})
dfR = pd.DataFrame({'ID': [3, 4, 5, 6], 'Value': ['C', 'D', 'E','F']})
print(dfL.head())
print(dfR.head())

   ID Value
0   1     A
1   2     B
2   3     C
3   4     D
   ID Value
0   3     C
1   4     D
2   5     E
3   6     F

In [18]:
#Inner join
inner_merged_df = pd.merge(dfL, dfR, on='ID', how='inner')
print(inner_merged_df)

   ID Value_x Value_y
0   3       C       C
1   4       D       D

In [19]:
#Outer join
outer_merged_df = pd.merge(dfL, dfR, on='ID', how="outer")
print(outer_merged_df)

   ID Value_x Value_y
0   1       A     NaN
1   2       B     NaN
2   3       C       C
3   4       D       D
4   5     NaN       E
5   6     NaN       F

In [20]:
#Left join
left_merged_df = pd.merge(dfL, dfR, on='ID', how="left")
print(left_merged_df)

   ID Value_x Value_y
0   1       A     NaN
1   2       B     NaN
2   3       C       C
3   4       D       D

In [21]:
#Right join
right_merged_df = pd.merge(dfL, dfR, on='ID', how="right")
print(right_merged_df)

   ID Value_x Value_y
0   3       C       C
1   4       D       D
2   5     NaN       E
3   6     NaN       F

In [22]:
#Aggregating / Grouping
#Group by category and get mean value and count
df_grouped = df1.groupby('Category').agg({'Value': 'mean', 'Count': 'sum'})
df_grouped

              Value  Count
Category
A         45.580645  186.0
B         50.517241  156.0
C         43.685714  158.0

In [23]:
#Pivot tables
pivot_table = df1.pivot_table(values='Value', index='Category', columns='Count', aggfunc='sum')
print(pivot_table)

Count      1.0    2.0    3.0    4.0    5.0    6.0   7.0    8.0    9.0    10.0
Category
A           NaN  150.0  156.0  234.0  227.0   45.0  83.0   55.0  177.0  286.0
B         156.0  265.0  183.0    2.0   91.0  191.0  96.0  147.0  106.0  228.0
C         177.0  141.0  140.0  291.0  447.0  148.0  97.0   53.0   16.0   19.0

In [24]:
#Write a data frame to a CSV file
df_grouped.to_csv('output.csv', index=False)

In [25]:
#Write a data frame to an Excel file
df_grouped.to_excel('output.xlsx', index=False)